<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 加载框架基础文件
require __DIR__ . '/../thinkphp/base.php';

// 绑定当前入口文件到模块
define('BIND_MODULE','admin');

// 执行应用
think\Container::get('app', [__DIR__ . '/../app/'])->run()->send();

