<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------
use think\facade\{
    Env
};
return [
    // 驱动方式
    'type'   =>  Env::get('cache.type','File'),
    // 缓存保存目录
    'path'   => '',
    // 缓存前缀
    'prefix' => Env::get('cache.prefix',''),
    // 缓存有效期 0表示永久缓存
    'expire' => Env::get('redis.expire',86400),
    // redis主机
    'host' => Env::get('redis.host','127.0.0.1'),
    // redis端口
    'port' => Env::get('redis.port',6379),
    // 缓存有效期 0表示永久缓存 密码
    'password' => Env::get('redis.password',''),
];
